# Tasks 
     1. Calculation of sales revenue(the product of sales quantity and unit_price) 
     2. Caluculation of sales revenue including discounts(as mentioned in the promotion table)
     3. Calculation of sales revenue including discounts and the demand adjustment factor

In [53]:
import pandas as pd

In [54]:
# Read xlsx file
file_name = "SalesData_Input.xlsx"
df = pd.read_excel(file_name, sheet_name=0)  # first sheet
df.head()

         Date  Product ID  Shop Code  Number Sold  Unit Price
0  1404/01/01           1          3          200       90000
1  1404/01/01           1          3            4      142000
2  1404/01/01           1          3            2      150000
3  1404/01/01           1          3            1      169000
4  1404/01/01           1          3            2      211000

In [57]:
# sales revenue | محاسبه حجم ریالی فروش

# number of products
unique_numbers = df["Product ID"].unique()
n_products = len(unique_numbers)
print(f"Number of Products: {n_products}")

# sales revenue for each record
df["sales_revenue"] = df["Number Sold"] * df["Unit Price"]

# جمع تعداد و فروش برای هر تاریخ، هر محصول، و هر قیمت
summary = df.groupby(["Date", "Product ID", "Unit Price"]).agg(
   Total_Number_Sold=("Number Sold", "sum"),
    Total_sales_revenue=("sales_revenue", "sum")
).reset_index()
summary.head(len(summary))

Number of Products: 20

          Date  Product ID  Unit Price  Total_Number_Sold  Total_sales_revenue
0   1404/01/01           1       90000                544             48960000
1   1404/01/01           1      142000                  4               568000
2   1404/01/01           1      148000                  5               740000
3   1404/01/01           1      150000                  2               300000
4   1404/01/01           1      156000                  1               156000
5   1404/01/01           1      166000                  1               166000
6   1404/01/01           1      169000                  1               169000
7   1404/01/01           1      189000                  1               189000
8   1404/01/01           1      211000                  2               422000
9   1404/01/01           1      234000                  1               234000
10  1404/01/01           1      259000                  1               259000
11  1404/01/02         313     2390000                103            246170000
12  1404/01/03         422     2860000                 24             68640000
13  1404/01/03         423     2650000                 33             87450000
14  1404/01/05         668     3150000                 86            270900000
15  1404/01/05         669     2550000                 73            186150000
16  1404/01/08         305     2090000                123            257070000
17  1404/01/08         308     2150000                 47            101050000
18  1404/01/09         313     2390000                147            351330000
19  1404/01/09         318     2620000                  1              2620000
20  1404/01/09         318     2790000                 95            265050000
21  1404/01/09         408     1920000                  9             17280000
22  1404/01/09         408     2090000                302            631180000
23  1404/01/09         409     1960000                  8             15680000
24  1404/01/09         409     2190000                402            880380000
25  1404/01/09         414     2420000                  6             14520000
26  1404/01/09         414     2590000                362            937580000
27  1404/01/09         415     2480000                  4              9920000
28  1404/01/09         415     2690000                497           1336930000
29  1404/01/09         417     4390000                  3             13170000
30  1404/01/09         419     2580000                  8             20640000
31  1404/01/09         419     2750000                453           1245750000
32  1404/01/09         422     2720000                  3              8160000
33  1404/01/09         422     2860000                 28             80080000
34  1404/02/27         720     1640000                222            364080000
35  1404/02/27         723     2340000                 49            114660000
36  1404/03/02          69      300000                  2               600000
37  1404/03/02         304     2550000                168            428400000
38  1404/03/02         305     2290000                580           1328200000
39  1404/04/21         311     2290000                190            435100000
40  1404/04/21         313     2690000                159            427710000
41  1404/04/21         318     3190000                 63            200970000
42  1404/04/21         408     2490000                182            453180000
43  1404/04/21         409     2590000                264            683760000
44  1404/04/21         414     2990000                121            361790000

In [58]:
# create xlsx
summary.to_excel("summary_total_sales_revenue.xlsx", index=False)
print("File is created ...")

File is created ...